[M_HeavensDoor MissionDefinition]
MissionDescription="Only one man stands between you and Piston: a teenage gladiator named Flyboy. Unfortunately, Flyboy's lair is -- to use his words -- ''friggin' impenetrable.''<br><br>The best you can hope for is to activate the three access points around the [place]Torgue Forge[-place], which will release some of Flyboy's personal buzzards. Then, you can kill the buzzards and -- if all goes well -- Flyboy will be angry enough to allow you into his lair, where he can kill you personally."
TurnInDescription="By opening the access points, you can now go after Flyboy's personal buzzard armada. If you can destroy them and piss Flyboy off, maybe you'll have a chance at entering his lair."
MissionSummary="Open the access points to Flyboy's lair."

[M_HeavensDoor:AccessPoint1 MissionObjectiveDefinition]
ProgressMessage="Switch on access point one"

[M_HeavensDoor:AccessPoint2 MissionObjectiveDefinition]
ProgressMessage="Switch on access point two"

[M_HeavensDoor:AccessPoint3 MissionObjectiveDefinition]
ProgressMessage="Switch on access point three"

[M_IrisEp5_CageMatch MissionDefinition]
MissionDescription="Only one man stands between you and Piston: a teenage gladiator named Flyboy. Moxxi told you that he was holed up in [place]Torgue Forge[-place] -- better head there and wipe him out."
TurnInDescription="You've reached Flyboy's forge. Now you've just gotta open the access points to his lair."
MissionSummary="Head to the [place]Torgue Forge[-place] and take down Flyboy."

[M_IrisEp5_CageMatch:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Only one man stands between you and Piston: a teenage gladiator named Flyboy. Moxxi told you that he was holed up in the [place]Torgue Forge[-place] -- now that you've finally got a key, you should head in there and take Flyboy out."

[M_IrisEp5_CageMatch:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionDescriptionOverride="Only one man stands between you and Piston: a teenage gladiator named Flyboy. Moxxi told you that he was holed up in the [place]Torgue Forge[-place].<br><br>Problem is that someone deadlocked the door to the Forge. Moxxi says that you'll need to fight your way into the Torgue Arena, infiltrate the security area, and steal a key to the Forge."

[M_IrisEp5_KickStartMyHeart MissionDefinition]
MissionDescription="Only one man stands between you and Piston: a teenage gladiator named Flyboy. <br><br>You've angered him, and you now have access to his lair. Get in there and knock him off his pedestal."
TurnInDescription="No more messing around -- it's time to win this tournament."

[M_IrisEp5_KickStartMyHeart:BreakIntoForge MissionObjectiveDefinition]
ProgressMessage="Reach Flyboy's tower"

[M_IrisEp5_KickStartMyHeart:DefeatBlimp MissionObjectiveDefinition]
ProgressMessage="Defeat Piston's blimp"

[M_IrisEp5_KickStartMyHeart:FlyboyRoom MissionObjectiveDefinition]
ProgressMessage="Reach Flyboy's lair"

[M_IrisEp5_KickStartMyHeart:MissionObjectiveSetDefinition_8 MissionObjectiveSetDefinition]
MissionSummaryOverride="Destroy Piston's blimp."
MissionDescriptionOverride="Only one man stood between you and Piston: a teenage gladiator named Flyboy.\n \nThat is, until Piston blew him up, anyway.<br><br>With a complete disregard for the rules, Piston interrupted your fight with Flyboy by killing the hell out of him with a gigantic, rocket-equipped blimp.<br><br>You know, the one that is shooting at you right now. You should probably fight back."
